Repository: dequeb/asmbattle
Catalog: locale/*/LC_MESSAGES/assembler.po
Languages: fr_ca

source: Undefined label: {code}
fr_ca: Libellé non défini : {code}

source: invalid literal for int() with base 10: {text} on line {line_number}: '{line}'
fr_ca: Valeur erronée pour un entier int() en base 10: {text} sur la ligne {line_number} : '{line}'

source: invalid value: {text} on line {line_number}: '{line}'
fr_ca: Valeur erronée : {text} sur la ligne {line_number} : '{line}'

source: offset must be a value between {OFF_SET_MIN}...{OFF_SET_MAX} on line {line_number}: '{line}'
fr_ca: Le décallage doit être entre {OFF_SET_MIN} et {OFF_SET_MAX} sur la ligne {line_number} : '{line}'

source: {type_number} must have a value between {MIN_VALUE}-{MAX_VALUE} on line {line_number}: '{line}'
fr_ca: {type_number} doit avoir une valeur entre {MIN_VALUE} et {MAX_VALUE} sur la ligne {line_number} : '{line}'

source: {text} is not a label on line {line_number}: '{line}'
fr_ca: {text} n'est pas un libellé sur la ligne {line_number} : '{line}'

source: {text} does not have a valid ASCII value: {value} on line {line_number}: '{line}'
fr_ca: {text} n'a pas une valeur reconnue en ASCII : {value} sur la ligne {line_number} : '{line}'

source: Only one character is allowed. Use String instead on line {line_number}: '{line}'
fr_ca: Un seul caractère permis. Utilisez plutôt une chaîne de caractères sur la ligne {line_number} : '{line}'

source: Duplicate label: {label}
fr_ca: Libellé en double : {label}

source: Label contains keyword: {upper_label} on line {line_number}: '{line}'
fr_ca: Le libellé contient un mot réservé : {upper_label} sur la ligne {line_number} : '{line}'

source: {instr}: too many arguments on line {line_number}: '{line}'
fr_ca: {instr}: trop de paramètres sur la ligne {line_number} : '{line}'

source: {inst} does not support operand {value1} on line {line_number}: '{line}'
fr_ca: {inst} ne reconnaît pas le paramètre {value1} sur la ligne {line_number} : '{line}'

source: {inst} does not support operands from {name1} to {name2} on line {line_number}: '{line}'
fr_ca: {inst} ne reconnaît pas les paramètres de {name1} à {name2} sur la ligne {line_number} : '{line}'

source: {inst} does not support operands {value1} and {value2} on line {line_number}: '{line}'
fr_ca: {inst} ne reconnaît pas les paramètres {value1} et {value2} sur la ligne {line_number} : '{line}'

source: Invalid instruction on line {line_number}: '{line}'
fr_ca: Instruction non-valide sur la ligne {line_number} : '{line}'
